Moddable-OpenSource/moddable/modules/network/ble/nrf52/modBLEServer.c
		if (serviceIndex != att_handles[i].service_index)
			continue;
			
		handle = att_handles[i].handles.value_handle;
		if (BLE_GATT_HANDLE_INVALID == handle)
			continue;
		
		xsVar(0) = xsmcNewObject();
		xsmcSetInteger(xsVar(1), handle);
		xsmcSet(xsVar(0), xsID_handle, xsVar(1));
			
		err_code = sd_ble_gatts_attr_get(handle, &uuid, NULL);
		if (NRF_SUCCESS == err_code) {
			uint8_t buffer[UUID_LEN_128];
			uint16_t uuid_length;
			uuidToBuffer(buffer, &uuid, &uuid_length);
			xsmcSetArrayBuffer(xsVar(1), buffer, uuid_length);
			xsmcSet(xsVar(0), xsID_uuid, xsVar(1));
		}
		err_code = sd_ble_gatts_value_get(gBLE->conn_handle, handle, &gatts_value);
		if (NRF_SUCCESS == err_code && 0 != gatts_value.len) {
			xsmcSetArrayBuffer(xsVar(1), (uint8_t*)gatts_value.p_value, gatts_value.len);
			xsmcSet(xsVar(0), xsID_value, xsVar(1));
		}

		for (uint16_t j = 0; j < char_name_count; ++j) {
			if (att_handles[i].service_index == char_names[j].service_index && att_handles[i].att_index == char_names[j].att_index) {
				xsmcSetString(xsVar(1), (char*)char_names[j].name);
				xsmcSet(xsVar(0), xsID_name, xsVar(1));
				xsmcSetString(xsVar(1), (char*)char_names[j].type);
				xsmcSet(xsVar(0), xsID_type, xsVar(1));
				break;
			}
		}
			
		xsCall1(xsResult, xsID_push, xsVar(0));
	}
}

void setAttributePermissions(security_req_t *read_access, security_req_t *write_access, security_req_t *cccd_write_access, uint8_t permissions)
{
	security_req_t security_req;
	if (NULL != read_access) {
		*read_access = (permissions & GATT_PERM_READ_ENCRYPTED ? (gBLE->mitm ? SEC_MITM : SEC_JUST_WORKS) : SEC_OPEN);
	}
	if (NULL != write_access) {
		*write_access = (permissions & GATT_PERM_WRITE_ENCRYPTED ? (gBLE->mitm ? SEC_MITM : SEC_JUST_WORKS) : SEC_OPEN);
	}
	if (NULL != cccd_write_access) {
		*cccd_write_access = (permissions & GATT_PERM_WRITE_ENCRYPTED ? (gBLE->mitm ? SEC_MITM : SEC_JUST_WORKS) : SEC_OPEN);
	}
}

void setAttributeProperties(ble_gatt_char_props_t *char_props, uint16_t properties)
{
	char_props->read = (properties & GATT_CHAR_PROP_BIT_READ ? 1 : 0);
	char_props->write_wo_resp = (properties & GATT_CHAR_PROP_BIT_WRITE_NR ? 1 : 0);
	char_props->write = (properties & GATT_CHAR_PROP_BIT_WRITE ? 1 : 0);
	char_props->notify = (properties & GATT_CHAR_PROP_BIT_NOTIFY ? 1 : 0);
	char_props->indicate = (properties & GATT_CHAR_PROP_BIT_INDICATE ? 1 : 0);
}

const char_name_table *handleToCharName(uint16_t handle) {
	for (uint16_t i = 0; i < handles_count; ++i) {
		ble_gatts_char_handles_t *handles = &att_handles[i].handles;
		if (handle == att_handles[i].handles.value_handle) {
			for (uint16_t k = 0; k < char_name_count; ++k) {
				if (char_names[k].service_index == att_handles[i].service_index && char_names[k].att_index == att_handles[i].att_index)
					return &char_names[k];
			}
		}
	}
	return NULL;
}

void bleServerReadyEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;
	
	xsBeginHost(the);
	xsCall1(gBLE->obj, xsID_callback, xsString("onReady"));
	xsEndHost(the);

	// Set appearance from app GAP service when available
	// Set device name from GAP service if app hasn't already set device name in onReady() callback
	ble_gap_conn_sec_mode_t sec_mode;
	char *device_name = NULL;
	uint16_t appearance = 128;	// generic computer
	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

	for (uint16_t i = 0; i < service_count; ++i) {
		gatts_attr_db_t *gatts_attr_db = (gatts_attr_db_t*)&gatt_db[i];
		attr_desc_t *att_desc = (attr_desc_t*)&gatts_attr_db->att_desc;
		if (UUID_LEN_16 == att_desc->uuid_length && 0x00 == att_desc->value[0] && 0x18 == att_desc->value[1]) {
			for (uint16_t j = 1; j < attribute_counts[i]; ++j) {
				att_desc = &gatts_attr_db[j].att_desc;
				if (0 == gBLE->deviceNameSet && UUID_LEN_16 == att_desc->uuid_length && 0x2A00 == *(uint16_t*)att_desc->uuid_p) {
					device_name = c_calloc(1, att_desc->length + 1);
					c_memmove(device_name, att_desc->value, att_desc->length);
				}
				if (UUID_LEN_16 == att_desc->uuid_length && 0x2A01 == *(uint16_t*)att_desc->uuid_p) {
					appearance = att_desc->value[1] << 8 | att_desc->value[0];
				}
			}
			break;
		}
	}
	
	sd_ble_gap_appearance_set(appearance);
	
	if (NULL != device_name) {
		sd_ble_gap_device_name_set(&sec_mode, device_name, c_strlen(device_name));
		c_free(device_name);
	}
	else if (0 == gBLE->deviceNameSet) {
		sd_ble_gap_device_name_set(&sec_mode, DEVICE_FRIENDLY_NAME, c_strlen(DEVICE_FRIENDLY_NAME));
	}
}

void bleServerCloseEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	modBLE ble = refcon;
	xs_ble_server_destructor(ble);
}

void gapConnectedEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;

	ble_gap_evt_t *gap_evt = (ble_gap_evt_t*)message;
	int16_t conn_handle = gap_evt->conn_handle;
	xsBeginHost(gBLE->the);
	if (BLE_CONN_HANDLE_INVALID != gBLE->conn_handle)
		goto bail;
	gBLE->conn_handle = conn_handle;
	gBLE->remote_bda = gap_evt->params.connected.peer_addr;
	xsmcVars(3);
	xsVar(0) = xsmcNewObject();
	xsmcSetInteger(xsVar(1), conn_handle);
	xsmcSet(xsVar(0), xsID_connection, xsVar(1));
	xsmcSetArrayBuffer(xsVar(2), gBLE->remote_bda.addr, BLE_GAP_ADDR_LEN);
	xsmcSet(xsVar(0), xsID_address, xsVar(2));
	xsCall2(gBLE->obj, xsID_callback, xsString("onConnected"), xsVar(0));
bail:
	xsEndHost(gBLE->the);
}

void gapDisconnectedEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;

    ret_code_t err_code;
	ble_gap_evt_t *gap_evt = (ble_gap_evt_t*)message;
	int16_t conn_handle = gap_evt->conn_handle;
	
	if (conn_handle != gBLE->conn_handle) return;
	xsBeginHost(gBLE->the);
	gBLE->conn_handle = BLE_CONN_HANDLE_INVALID;
	xsmcVars(3);
	xsVar(0) = xsmcNewObject();
	xsmcSetInteger(xsVar(1), conn_handle);
	xsmcSet(xsVar(0), xsID_connection, xsVar(1));
	xsmcSetArrayBuffer(xsVar(2), gBLE->remote_bda.addr, BLE_GAP_ADDR_LEN);
	xsmcSet(xsVar(0), xsID_address, xsVar(2));
	xsCall2(gBLE->obj, xsID_callback, xsString("onDisconnected"), xsVar(0));
	xsEndHost(gBLE->the);
}

void gapAuthKeyRequestEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;

